-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- Хост: localhost
-- Время создания: Июн 27 2023 г., 11:44
-- Версия сервера: 5.7.27-30
-- Версия PHP: 7.1.33

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `u2112369_default`
--

-- --------------------------------------------------------

--
-- Структура таблицы `INC`
--

CREATE TABLE `INC` (
  `DEZ` tinytext NOT NULL COMMENT 'Ответственный дежурный',
  `ID` int(1) NOT NULL COMMENT 'Идентификатор',
  `DTF` datetime NOT NULL COMMENT 'Дата время обнаружения',
  `TYP` text NOT NULL COMMENT 'Тип инцидента',
  `CRT` text NOT NULL COMMENT 'Критичность',
  `TRG` mediumtext NOT NULL COMMENT 'Цель',
  `DSC` longtext NOT NULL COMMENT 'Описание',
  `EXC` text NOT NULL COMMENT 'Ответственный Исполнитель',
  `SRC` text NOT NULL COMMENT 'Откуда получена информация',
  `DTE` datetime NOT NULL COMMENT 'Дата окончания',
  `MES` longtext NOT NULL COMMENT 'Меры по закрытию',
  `END` text NOT NULL COMMENT 'Закрыт или нет'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `INC`
--

INSERT INTO `INC` (`DEZ`, `ID`, `DTF`, `TYP`, `CRT`, `TRG`, `DSC`, `EXC`, `SRC`, `DTE`, `MES`, `END`) VALUES
('1231234', 6, '0000-00-00 00:00:00', 'ÐŸÑ€Ð¾Ð±Ð»ÐµÐ¼Ð° Ð½Ð° ÑÑ‚Ð¾Ñ€Ð¾Ð½Ðµ Ñ€Ð°Ð·Ñ€Ð°Ð±Ð¾Ñ‚Ñ‡Ð¸ÐºÐ°', 'ÐšÑ€Ð¸Ñ‚Ð¸Ñ‡ÐµÑÐºÐ¸Ð¹', '12342134', '23421342', 'Ð¢Ð¸Ñ€Ð°Ð½Ð¾Ð² Ð.Ð®.', 'Ð¡Ð¸ÑÑ‚ÐµÐ¼Ñ‹ Ð¼Ð¾Ð½Ð¸Ñ‚Ð¾Ñ€Ð¸Ð½Ð³Ð° Zabbix', '0000-00-00 00:00:00', '1412414', 'Ð—Ð°ÐºÑ€Ñ‹Ñ‚'),
('1231234', 7, '2023-12-25 12:12:23', 'Ð­ÐºÑÐ¿Ð»ÑƒÐ°Ñ‚Ð°Ñ†Ð¸Ñ ÑƒÑÐ·Ð²Ð¸Ð¼Ð¾ÑÑ‚Ð¸', 'Ð’Ñ‹ÑÐ¾ÐºÐ¸Ð¹', '12342134', '23421342', 'ÐœÐ¸Ñ…Ð°Ð¹Ð»Ð¾Ð² Ð.Ð.', 'Ð¡Ð¸ÑÑ‚ÐµÐ¼Ñ‹ Ð¼Ð¾Ð½Ð¸Ñ‚Ð¾Ñ€Ð¸Ð½Ð³Ð° Zabbix', '0000-00-00 00:00:00', '1412414', 'Ð—Ð°ÐºÑ€Ñ‹Ñ‚'),
('1231234', 9, '2023-12-25 12:12:23', 'Ð’Ñ€ÐµÐ´Ð¾Ð½Ð¾ÑÐ½Ð¾Ðµ ÐŸÐž', 'Ð’Ñ‹ÑÐ¾ÐºÐ¸Ð¹', '12342134', 'Ð¿Ñ€Ð¾Ð¸Ð·Ð»ÑˆÐ»Ð¾ Ð¼Ð°ÐºÐ»Ð²Ð»Ð°Ñ‚Ñ€Ð¼Ñ Ð°Ð²Ð¸Ð¿Ñ‹Ð²Ð¶Ð¸Ð»Ñ‹  Ð²Ñ‹ÐºÐ¿Ð¸Ñ‹Ð²ÑƒÐºÐ°Ð¿Ð²Ñ‹Ð°Ð¿ Ð²Ñ‹Ð¿Ð²Ñ‹Ð°Ð¿Ð²Ñ‹Ð°Ð¿ Ð²Ñ‹Ð¿Ñ‹Ð²Ð°Ð¿ Ð²Ð°Ð¿ Ñ‡ÑÐ°Ð²Ð¿Ñ‹Ð²Ð°Ð¿Ð²Ñ‹ÐºÐ° Ð²Ð°Ð¿Ñ‹Ð²Ð°Ð¿Ð²Ñ‹Ð°Ð¿ Ð²Ð¿Ñ‹Ð²Ð°Ð¿Ñ‹Ð²Ð°Ð¿ Ð²Ñ‹Ð¿Ð²Ñ‹Ð°Ð¿Ð²Ñ‹ ', 'Ð¢Ð¸Ñ€Ð°Ð½Ð¾Ð² Ð.Ð®.', 'Ð¡Ð¸ÑÑ‚ÐµÐ¼Ñ‹ Ð¼Ð¾Ð½Ð¸Ñ‚Ð¾Ñ€Ð¸Ð½Ð³Ð° Zabbix', '2023-12-22 12:22:23', 'sadffffffff', 'Ð—Ð°ÐºÑ€Ñ‹Ñ‚'),
('1231234', 10, '2023-12-25 12:12:23', 'Ð’Ñ€ÐµÐ´Ð¾Ð½Ð¾ÑÐ½Ð¾Ðµ ÐŸÐž', 'Ð’Ñ‹ÑÐ¾ÐºÐ¸Ð¹', '12342134', 'Ð¿Ñ€Ð¾Ð¸Ð·Ð»ÑˆÐ»Ð¾ Ð¼Ð°ÐºÐ»Ð²Ð»Ð°Ñ‚Ñ€Ð¼Ñ Ð°Ð²Ð¸Ð¿Ñ‹Ð²Ð¶Ð¸Ð»Ñ‹  Ð²Ñ‹ÐºÐ¿Ð¸Ñ‹Ð²ÑƒÐºÐ°Ð¿Ð²Ñ‹Ð°Ð¿ Ð²Ñ‹Ð¿Ð²Ñ‹Ð°Ð¿Ð²Ñ‹Ð°Ð¿ Ð²Ñ‹Ð¿Ñ‹Ð²Ð°Ð¿ Ð²Ð°Ð¿ Ñ‡ÑÐ°Ð²Ð¿Ñ‹Ð²Ð°Ð¿Ð²Ñ‹ÐºÐ° Ð²Ð°Ð¿Ñ‹Ð²Ð°Ð¿Ð²Ñ‹Ð°Ð¿ Ð²Ð¿Ñ‹Ð²Ð°Ð¿Ñ‹Ð²Ð°Ð¿ Ð²Ñ‹Ð¿Ð²Ñ‹Ð°Ð¿Ð²Ñ‹ ', 'Ð¢Ð¸Ñ€Ð°Ð½Ð¾Ð² Ð.Ð®.', 'Ð¡Ð¸ÑÑ‚ÐµÐ¼Ñ‹ Ð¼Ð¾Ð½Ð¸Ñ‚Ð¾Ñ€Ð¸Ð½Ð³Ð° Zabbix', '2023-12-22 12:22:23', 'sadffffffff', 'Ð—Ð°ÐºÑ€Ñ‹Ñ‚'),
('1231234', 11, '2023-12-25 12:12:23', 'Ð’Ñ€ÐµÐ´Ð¾Ð½Ð¾ÑÐ½Ð¾Ðµ ÐŸÐž', 'Ð’Ñ‹ÑÐ¾ÐºÐ¸Ð¹', '12342134', 'Ð¿Ñ€Ð¾Ð¸Ð·Ð»ÑˆÐ»Ð¾ Ð¼Ð°ÐºÐ»Ð²Ð»Ð°Ñ‚Ñ€Ð¼Ñ Ð°Ð²Ð¸Ð¿Ñ‹Ð²Ð¶Ð¸Ð»Ñ‹  Ð²Ñ‹ÐºÐ¿Ð¸Ñ‹Ð²ÑƒÐºÐ°Ð¿Ð²Ñ‹Ð°Ð¿ Ð²Ñ‹Ð¿Ð²Ñ‹Ð°Ð¿Ð²Ñ‹Ð°Ð¿ Ð²Ñ‹Ð¿Ñ‹Ð²Ð°Ð¿ Ð²Ð°Ð¿ Ñ‡ÑÐ°Ð²Ð¿Ñ‹Ð²Ð°Ð¿Ð²Ñ‹ÐºÐ° Ð²Ð°Ð¿Ñ‹Ð²Ð°Ð¿Ð²Ñ‹Ð°Ð¿ Ð²Ð¿Ñ‹Ð²Ð°Ð¿Ñ‹Ð²Ð°Ð¿ Ð²Ñ‹Ð¿Ð²Ñ‹Ð°Ð¿Ð²Ñ‹ ', 'Ð¢Ð¸Ñ€Ð°Ð½Ð¾Ð² Ð.Ð®.', 'Ð¡Ð¸ÑÑ‚ÐµÐ¼Ñ‹ Ð¼Ð¾Ð½Ð¸Ñ‚Ð¾Ñ€Ð¸Ð½Ð³Ð° Zabbix', '2023-12-22 12:22:23', 'cffdfgfgfghf', 'Ð—Ð°ÐºÑ€Ñ‹Ñ‚'),
('1231234', 12, '2023-12-25 12:12:23', 'Ð’Ñ€ÐµÐ´Ð¾Ð½Ð¾ÑÐ½Ð¾Ðµ ÐŸÐž', 'Ð’Ñ‹ÑÐ¾ÐºÐ¸Ð¹', '12342134', 'Ð¿Ñ€Ð¾Ð¸Ð·Ð»ÑˆÐ»Ð¾ Ð¼Ð°ÐºÐ»Ð²Ð»Ð°Ñ‚Ñ€Ð¼Ñ Ð°Ð²Ð¸Ð¿Ñ‹Ð²Ð¶Ð¸Ð»Ñ‹  Ð²Ñ‹ÐºÐ¿Ð¸Ñ‹Ð²ÑƒÐºÐ°Ð¿Ð²Ñ‹Ð°Ð¿ Ð²Ñ‹Ð¿Ð²Ñ‹Ð°Ð¿Ð²Ñ‹Ð°Ð¿ Ð²Ñ‹Ð¿Ñ‹Ð²Ð°Ð¿ Ð²Ð°Ð¿ Ñ‡ÑÐ°Ð²Ð¿Ñ‹Ð²Ð°Ð¿Ð²Ñ‹ÐºÐ° Ð²Ð°Ð¿Ñ‹Ð²Ð°Ð¿Ð²Ñ‹Ð°Ð¿ Ð²Ð¿Ñ‹Ð²Ð°Ð¿Ñ‹Ð²Ð°Ð¿ Ð²Ñ‹Ð¿Ð²Ñ‹Ð°Ð¿Ð²Ñ‹ ', 'Ð¢Ð¸Ñ€Ð°Ð½Ð¾Ð² Ð.Ð®.', 'Ð¡Ð¸ÑÑ‚ÐµÐ¼Ñ‹ Ð¼Ð¾Ð½Ð¸Ñ‚Ð¾Ñ€Ð¸Ð½Ð³Ð° Zabbix', '2023-12-22 12:22:23', 'sadffffffff', 'Ð—Ð°ÐºÑ€Ñ‹Ñ‚'),
('1231234', 13, '2023-12-25 12:12:23', 'ÐŸÑ€Ð¾Ð±Ð»ÐµÐ¼Ð° Ð½Ð° ÑÑ‚Ð¾Ñ€Ð¾Ð½Ðµ Ñ€Ð°Ð·Ñ€Ð°Ð±Ð¾Ñ‚Ñ‡Ð¸ÐºÐ°', 'ÐÐ¸Ð·ÐºÐ¸Ð¹', '12342134', '234213412421342142314', 'ÐœÐ¸Ñ…Ð°Ð¹Ð»Ð¾Ð² Ð.Ð.', 'MaxPatrol 8', '2023-12-22 12:22:23', '132412424241234', 'ÐžÑ‚ÐºÑ€Ñ‹Ñ‚');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `INC`
--
ALTER TABLE `INC`
  ADD PRIMARY KEY (`ID`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `INC`
--
ALTER TABLE `INC`
  MODIFY `ID` int(1) NOT NULL AUTO_INCREMENT COMMENT 'Идентификатор', AUTO_INCREMENT=15;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
